<a href="https://colab.research.google.com/github/IsmaelEA2020/Fisica-computacional/blob/main/Actividad3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
#IMPORTAMOS NUESTRAS BBIBLIOTECAS
import pandas as pd
import numpy as np

In [3]:
# Hay muchas formas de declarar este tipo de objetos. 
# Se introdujo un espacio vacío '', haciendo alusión a que no se tiene ese dato. 
data ={'manzanas':[3,2,0,1],'naranjas':[0,'',7,2]}
df_compras = pd.DataFrame(data)
df_compras

   manzanas naranjas
0         3        0
1         2
2         0        7
3         1        2

In [4]:
# Añadimos la lista de personas que compran fruta 
clientes = ['Ana', 'Roberto', 'Lily', 'David']
df_compras = pd.DataFrame(data, index=clientes)
df_compras

         manzanas naranjas
Ana             3        0
Roberto         2
Lily            0        7
David           1        2

In [5]:
# Podemos ver que compró Ana (selección del renglón con .loc)
df_compras.loc['Ana']

manzanas    3
naranjas    0
Name: Ana, dtype: object

In [6]:
df_compras.iloc[0]

manzanas    3
naranjas    0
Name: Ana, dtype: object

In [7]:
# Se puede escribir a un archivo csv el DataFrame df_compras
df_compras.to_csv('compras.csv')

In [9]:
# Imrimimos los primeros 3 renglones del DatFrame
df_compras=pd.read_csv('compras.csv')
df_compras.head(3)

  Unnamed: 0  manzanas  naranjas
0        Ana         3       0.0
1    Roberto         2       NaN
2       Lily         0       7.0

In [10]:
# Podemos renombrar las columnas 
df_compras.rename(columns={'Unnamed: 0': 'Nombre'}, inplace=True)

In [11]:
# Dimensiones del DataFrame (renglones, columnas)
df_compras.shape

(4, 3)

In [12]:
# Imprime la informaciónd el DataFrame
df_compras.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    4 non-null      object
 1   manzanas  4 non-null      int64
 2   naranjas  3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [13]:
# Realiza una estadística breve de las variables numéricas
df_compras.describe()

       manzanas  naranjas
count  4.000000  3.000000
mean   1.500000  3.000000
std    1.290994  3.605551
min    0.000000  0.000000
25%    0.750000  1.000000
50%    1.500000  2.000000
75%    2.250000  4.500000
max    3.000000  7.000000

In [14]:
# En el caso de variables no numéricas, hace un conteo.
df_compras['Nombre'].describe()

count           4
unique          4
top       Roberto
freq            1
Name: Nombre, dtype: object

In [15]:
df_compras.value_counts().head()

Nombre  manzanas  naranjas
Lily    0         7.0         1
David   1         2.0         1
Ana     3         0.0         1
dtype: int64

In [16]:
df_compras.columns

Index(['Nombre', 'manzanas', 'naranjas'], dtype='object')

In [17]:
df_compras.columns = ['Names', 'apples', 'oranges']

In [19]:
df_compras.columns

Index(['Names', 'apples', 'oranges'], dtype='object')

In [20]:
df_compras.head()

     Names  apples  oranges
0      Ana       3      0.0
1  Roberto       2      NaN
2     Lily       0      7.0
3    David       1      2.0

In [21]:

df_compras.head()

     Names  apples  oranges
0      Ana       3      0.0
1  Roberto       2      NaN
2     Lily       0      7.0
3    David       1      2.0

In [23]:
# Creación de un ejemplo de DataFrame con valores aleatorios
from numpy.random import randn
df = pd.DataFrame(randn(6,4),index='0 1 2 3 4 5'.split(),columns='A B C D'.split())

In [24]:
df

          A         B         C         D
0  1.286615  1.567960  0.125947  0.851291
1 -1.276091  0.722922  0.915355 -0.207641
2  0.037283 -0.888911 -0.889720 -0.433565
3  0.623264 -0.273526 -0.851171  1.032822
4  1.268664  2.186480  0.682797 -1.624275
5 -1.596623  0.798092 -0.723584 -0.148440

In [25]:
# Imprime el tercer renglon con etiqueta '3' 
df.loc['3']

A    0.623264
B   -0.273526
C   -0.851171
D    1.032822
Name: 3, dtype: float64

In [26]:
# Imprime el renglón con índice 3
df.iloc[3]

A    0.623264
B   -0.273526
C   -0.851171
D    1.032822
Name: 3, dtype: float64

In [27]:
# Imprime un elemento específico. 
df.loc['2', 'C']

-0.8897196319193186

In [28]:
# Imprime un rango de renglones
df.loc['2':'4']

          A         B         C         D
2  0.037283 -0.888911 -0.889720 -0.433565
3  0.623264 -0.273526 -0.851171  1.032822
4  1.268664  2.186480  0.682797 -1.624275

In [29]:
# Imprime un rango de renglones (No imprime el renglón del límite superior)
df.iloc[2:4]

          A         B         C         D
2  0.037283 -0.888911 -0.889720 -0.433565
3  0.623264 -0.273526 -0.851171  1.032822

In [30]:
# Imprimiendo sólo columnas
df.loc['0':'4','A':'B']

          A         B
0  1.286615  1.567960
1 -1.276091  0.722922
2  0.037283 -0.888911
3  0.623264 -0.273526
4  1.268664  2.186480

In [31]:
# Imprimimos de forma directa dos columnas
df[['A','B']]

          A         B
0  1.286615  1.567960
1 -1.276091  0.722922
2  0.037283 -0.888911
3  0.623264 -0.273526
4  1.268664  2.186480
5 -1.596623  0.798092

In [32]:
# India donde se cumple la condición
df>0.5

       A      B      C      D
0   True   True  False   True
1  False   True   True  False
2  False  False  False  False
3   True  False  False   True
4   True   True   True  False
5  False   True  False  False

In [33]:
df

          A         B         C         D
0  1.286615  1.567960  0.125947  0.851291
1 -1.276091  0.722922  0.915355 -0.207641
2  0.037283 -0.888911 -0.889720 -0.433565
3  0.623264 -0.273526 -0.851171  1.032822
4  1.268664  2.186480  0.682797 -1.624275
5 -1.596623  0.798092 -0.723584 -0.148440

In [34]:
# Filtra los renglones donde la columna B cumple la condición
df[df['B'] <= 0.25]

          A         B         C         D
2  0.037283 -0.888911 -0.889720 -0.433565
3  0.623264 -0.273526 -0.851171  1.032822

In [37]:
# Se pueden combinar condiciones para filtrar renglones
df[(df['B'] <= 0.25) & (df['C'] >= 0.5)]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [38]:
import numpy as np
df2 = pd.DataFrame({'A':[1,np.nan,3,4,np.nan,7,2,np.nan],
                  'B':[5,np.nan,6,5,7,2,np.nan,5],
                  'C':[5,3,6,5,7,2,8,5],
                  'D':[1,2,3,np.nan,5,np.nan,7,8]})

In [39]:
df2

     A    B  C    D
0  1.0  5.0  5  1.0
1  NaN  NaN  3  2.0
2  3.0  6.0  6  3.0
3  4.0  5.0  5  NaN
4  NaN  7.0  7  5.0
5  7.0  2.0  2  NaN
6  2.0  NaN  8  7.0
7  NaN  5.0  5  8.0

In [40]:
# Selecciona solo renglones que no tienen algún dato vacío
df2.dropna()

     A    B  C    D
0  1.0  5.0  5  1.0
2  3.0  6.0  6  3.0

In [41]:
# Selecciona solo columnas que no tienen ningún dato vacío
df2.dropna(axis=1)

   C
0  5
1  3
2  6
3  5
4  7
5  2
6  8
7  5

In [42]:
# Se define un DataFrame con valores vacíos rellenados con el valor 0.
df3=df2.fillna(value=0)
df3

     A    B  C    D
0  1.0  5.0  5  1.0
1  0.0  0.0  3  2.0
2  3.0  6.0  6  3.0
3  4.0  5.0  5  0.0
4  0.0  7.0  7  5.0
5  7.0  2.0  2  0.0
6  2.0  0.0  8  7.0
7  0.0  5.0  5  8.0

In [43]:
df3.iloc[2:4]

     A    B  C    D
2  3.0  6.0  6  3.0
3  4.0  5.0  5  0.0

In [44]:
df3.loc['2':'4']

     A    B  C    D
2  3.0  6.0  6  3.0
3  4.0  5.0  5  0.0
4  0.0  7.0  7  5.0

In [45]:
df3[df3['B'] == 5.0]

     A    B  C    D
0  1.0  5.0  5  1.0
3  4.0  5.0  5  0.0
7  0.0  5.0  5  8.0

In [46]:
df3[(df3['B'] == 5.0) & (df3['D'] < 2.0)]

     A    B  C    D
0  1.0  5.0  5  1.0
3  4.0  5.0  5  0.0

In [47]:
df4=df3[['B','C']]
df4

     B  C
0  5.0  5
1  0.0  3
2  6.0  6
3  5.0  5
4  7.0  7
5  2.0  2
6  0.0  8
7  5.0  5

In [50]:
import pandas as pd
import numpy as np

# Tomar la dirección URL del archivo en formato 'raw'
url = 'https://raw.githubusercontent.com/IsmaelEA2020/Fisica-computacional/main/Actividad%203/Climatolog%C3%ADa.txt'

# Definimos los nombres de las columnas
# El archivo tiene códigos ASCII extendido (Español), encoding='cp1251' Windows (Europa Occidental)
# El separador de datos es de uno o más espacios, sep='\s+'
# Se brincará los primeros 19 renglones y el último, afirmamos que no nay encabezado
# Se procesan los datos utilizando Python, engine='python' 
my_cols = ['Fecha', 'Precip', 'Evap', 'Tmax', 'Tmin']
df_dist = pd.read_csv(url, names=my_cols, encoding='cp1251', sep='\s+', header=None, skiprows=19, skipfooter=1, engine='python')

In [51]:

# Revisamos el encabezado y el final del dataframe
print(df_dist.head(3))
print(df_dist.tail())

        Fecha  Precip Evap  Tmax  Tmin
0  01/01/2010     0.0  4.2  29.0  11.5
1  02/01/2010     0.0  3.6  28.0  11.5
2  03/01/2010     0.0  4.7  29.5  14.5
           Fecha  Precip Evap  Tmax  Tmin
3431  27/05/2019     0.0    9  35.5  19.5
3432  28/05/2019     0.0  8.6  35.0  18.5
3433  29/05/2019     0.0  8.8  34.5  18.0
3434  30/05/2019     0.0  8.6  37.0  19.0
3435  31/05/2019     0.0  8.9  37.5  21.0

In [53]:
#Investigamos su tamaño con la función shape (renglones, columnas)
df_dist.shape

(3436, 5)

In [54]:
# Información del dataframe
df_dist.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3436 entries, 0 to 3435
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   3436 non-null   object
 1   Precip  3436 non-null   float64
 2   Evap    3436 non-null   object
 3   Tmax    3436 non-null   float64
 4   Tmin    3436 non-null   float64
dtypes: float64(3), object(2)
memory usage: 134.3+ KB

In [55]:
# Hacemos una copia de trabajo y preservamos el dataframe original
df_work0 = df_dist.copy()
df_work0.head()

        Fecha  Precip Evap  Tmax  Tmin
0  01/01/2010     0.0  4.2  29.0  11.5
1  02/01/2010     0.0  3.6  28.0  11.5
2  03/01/2010     0.0  4.7  29.5  14.5
3  04/01/2010     0.0  3.8  30.0  11.0
4  05/01/2010     0.0  3.8  29.5  13.5

In [56]:
# Reemplazamos los textos 'Nulo' por espacio en blanco ''
str_Nulo = 'Nulo'
df_work1 = df_work0.replace(to_replace=str_Nulo, value='', regex=True)
df_work1.head()

        Fecha  Precip Evap  Tmax  Tmin
0  01/01/2010     0.0  4.2  29.0  11.5
1  02/01/2010     0.0  3.6  28.0  11.5
2  03/01/2010     0.0  4.7  29.5  14.5
3  04/01/2010     0.0  3.8  30.0  11.0
4  05/01/2010     0.0  3.8  29.5  13.5

In [57]:
# Imprimimos la información actualizada del dataframe
df_work1.info()
print(df_work1.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3436 entries, 0 to 3435
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   3436 non-null   object
 1   Precip  3436 non-null   float64
 2   Evap    3436 non-null   object
 3   Tmax    3436 non-null   float64
 4   Tmin    3436 non-null   float64
dtypes: float64(3), object(2)
memory usage: 134.3+ KB
        Fecha  Precip Evap  Tmax  Tmin
0  01/01/2010     0.0  4.2  29.0  11.5
1  02/01/2010     0.0  3.6  28.0  11.5
2  03/01/2010     0.0  4.7  29.5  14.5
3  04/01/2010     0.0  3.8  30.0  11.0
4  05/01/2010     0.0  3.8  29.5  13.5

In [58]:
# Deseamos convertir los valores de las variables ambientales a núm. flotantes 
cols_list = ['Precip', 'Evap', 'Tmax', 'Tmin']
for cols in cols_list:
  df_work1[cols] = pd.to_numeric(df_work1[cols], errors='coerce')

df_work1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3436 entries, 0 to 3435
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   3436 non-null   object
 1   Precip  3436 non-null   float64
 2   Evap    3425 non-null   float64
 3   Tmax    3436 non-null   float64
 4   Tmin    3436 non-null   float64
dtypes: float64(4), object(1)
memory usage: 134.3+ KB

In [59]:
# De la instrucción anterior, vemos que hay valores faltantes. Sumamos los valores nulos. 
df_work1.isnull().sum()

Fecha      0
Precip     0
Evap      11
Tmax       0
Tmin       0
dtype: int64

In [60]:
print(df_work1.head())
print(df_work1.head())

        Fecha  Precip  Evap  Tmax  Tmin
0  01/01/2010     0.0   4.2  29.0  11.5
1  02/01/2010     0.0   3.6  28.0  11.5
2  03/01/2010     0.0   4.7  29.5  14.5
3  04/01/2010     0.0   3.8  30.0  11.0
4  05/01/2010     0.0   3.8  29.5  13.5
        Fecha  Precip  Evap  Tmax  Tmin
0  01/01/2010     0.0   4.2  29.0  11.5
1  02/01/2010     0.0   3.6  28.0  11.5
2  03/01/2010     0.0   4.7  29.5  14.5
3  04/01/2010     0.0   3.8  30.0  11.0
4  05/01/2010     0.0   3.8  29.5  13.5

In [61]:
# Un análisis estadístico breve de las variables numéricas redondeado a 2 cifras significativas
df_work1.describe().round(2)

        Precip     Evap     Tmax     Tmin
count  3436.00  3425.00  3436.00  3436.00
mean      1.72     6.46    33.03    18.53
std       8.20     2.77     3.83     5.27
min       0.00     0.40    13.50     2.00
25%       0.00     4.30    30.50    14.38
50%       0.00     6.00    33.50    18.00
75%       0.00     8.60    36.00    23.50
max     182.30    17.40    43.50    28.50

In [62]:
# Volvemos a hacer una pausa y definimos un nuevo dataframe por si hay que regresarse.
df_work2 = df_work1.copy()
df_work2['Fecha'].head()

0    01/01/2010
1    02/01/2010
2    03/01/2010
3    04/01/2010
4    05/01/2010
Name: Fecha, dtype: object

In [63]:
# Intentamos a ver si Python reconoce el formato en nuestro caso. 
# Agregamos la opción de que el primer dato es el día (dayfirst=True)
df_work2['Fecha']=pd.to_datetime(df_work2['Fecha'], dayfirst=True).copy()
print(df_work1.head())

        Fecha  Precip  Evap  Tmax  Tmin
0  01/01/2010     0.0   4.2  29.0  11.5
1  02/01/2010     0.0   3.6  28.0  11.5
2  03/01/2010     0.0   4.7  29.5  14.5
3  04/01/2010     0.0   3.8  30.0  11.0
4  05/01/2010     0.0   3.8  29.5  13.5

In [64]:
# Verificamos que cada variable (columna), sea del tipo que esperamos.
# Observamos que la variable Fecha es de tipo 'datetime64[ns]'  
df_work2.dtypes

Fecha     datetime64[ns]
Precip           float64
Evap             float64
Tmax             float64
Tmin             float64
dtype: object

In [65]:
# Buscamos ahora añadir dos columnas adicionales: df['Año'], df['Mes']
# Usaremos la función .dt.year y .dt.month para extraer el Año y Mes de la Fecha
df_work2['Año'] = df_work2['Fecha'].dt.year
df_work2['Mes'] = df_work2['Fecha'].dt.month

In [66]:
# Tendremos ahora dos columnas adicionales que podemos utilizar para filtrar información.
print(df_work2.head())
print(df_work2.tail())

       Fecha  Precip  Evap  Tmax  Tmin   Año  Mes
0 2010-01-01     0.0   4.2  29.0  11.5  2010    1
1 2010-01-02     0.0   3.6  28.0  11.5  2010    1
2 2010-01-03     0.0   4.7  29.5  14.5  2010    1
3 2010-01-04     0.0   3.8  30.0  11.0  2010    1
4 2010-01-05     0.0   3.8  29.5  13.5  2010    1
          Fecha  Precip  Evap  Tmax  Tmin   Año  Mes
3431 2019-05-27     0.0   9.0  35.5  19.5  2019    5
3432 2019-05-28     0.0   8.6  35.0  18.5  2019    5
3433 2019-05-29     0.0   8.8  34.5  18.0  2019    5
3434 2019-05-30     0.0   8.6  37.0  19.0  2019    5
3435 2019-05-31     0.0   8.9  37.5  21.0  2019    5

In [67]:
# Verificamos que Año y Mes son variables enteras.
# Hasta aquí llegaremos esta semana. 
df_work2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3436 entries, 0 to 3435
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   3436 non-null   datetime64[ns]
 1   Precip  3436 non-null   float64
 2   Evap    3425 non-null   float64
 3   Tmax    3436 non-null   float64
 4   Tmin    3436 non-null   float64
 5   Año     3436 non-null   int64
 6   Mes     3436 non-null   int64
dtypes: datetime64[ns](1), float64(4), int64(2)
memory usage: 188.0 KB